#+title: Ollama Buddy: Testing
#+author: James Dyer
#+email: captainflasmr@gmail.com
#+language: en
#+options: ':t toc:nil author:nil email:nil num:nil title:nil
#+todo: TODO DOING | DONE
#+startup: showall

* Ollama Buddy Testing Process/Strategy

This file contains a description of my testing strategy for the =ollama-buddy= Emacs package and the tests directory includes local unit tests and files to aid in robustly testing before pushing to =github= https://github.com/captainflasmr/ollama-buddy and then on to MELPA.

** Validate/lint elisp

- Run =checkdoc=
- =byte-compile= on ollama-buddy.el
- =flycheck= on ollama-buddy.el
- =package-lint= on ollama-buddy.el
- Possibly =melpazoid= (if I can be bothered!)

** Batch-byte-compile

#+begin_src bash
#!/bin/bash

# List of elisp files to compile
elisp_files=(
  "ollama-buddy-annotate.el"
  "ollama-buddy-claude.el"
  "ollama-buddy-codestral.el"
  "ollama-buddy-completion.el"
  "ollama-buddy-copilot.el"
  "ollama-buddy-core.el"
  "ollama-buddy-curl.el"
  "ollama-buddy-deepseek.el"
  "ollama-buddy.el"
  "ollama-buddy-gemini.el"
  "ollama-buddy-grok.el"
  "ollama-buddy-openai-compat.el"
  "ollama-buddy-openai.el"
  "ollama-buddy-opencode.el"
  "ollama-buddy-openrouter.el"
  "ollama-buddy-plan.el"
  "ollama-buddy-project.el"
  "ollama-buddy-provider.el"
  "ollama-buddy-rag.el"
  "ollama-buddy-remote.el"
  "ollama-buddy-rewrite.el"
  "ollama-buddy-tips.el"
  "ollama-buddy-tools.el"
  "ollama-buddy-transient.el"
  "ollama-buddy-user-prompts.el"
  "ollama-buddy-web-search.el"
)

# Directory above current one
elisp_dir="$( cd "$( dirname "${BASH_SOURCE[0]}" )/.." && pwd )"

for el in "${elisp_files[@]}"; do
  emacs -Q --batch \
    --eval "(add-to-list 'load-path \"$elisp_dir\")" \
    -f batch-byte-compile "$elisp_dir/$el"
done
#+end_src

#+RESULTS:

** Run ollama-buddy with different Emacs versions

- [X] emacs-28.1
- [X] emacs-29.3
- [X] emacs-29.4
- [X] emacs-30.1

Using the following script to generate a very simple init.el file which is then run up against varying versions of Emacs to then run up =ollama-buddy= using =C-c o= and perform some quick tests.

#+begin_src bash
#!/bin/bash

# Script to test ollama-buddy package in a vanilla Emacs environment
# Usage: ./test-ollama-buddy.sh [emacs-version]
# Example: ./test-ollama-buddy.sh 29.3

# Default Emacs version if none specified
VERSION=${1:-"28.2"}
PACKAGE_PATH="$HOME/source/repos/ollama-buddy"

# Create a temporary directory for the test
TEMP_DIR=$(mktemp -d -t ollama-buddy-test-XXXXXX)
INIT_FILE="$TEMP_DIR/init.el"

# Create a minimal init.el file
cat > "$INIT_FILE" << EOF
;; Minimal init.el for testing ollama-buddy (offline version)

;; Add the package to the load path
(add-to-list 'load-path "$PACKAGE_PATH")

;; Load the package
(require 'ollama-buddy)

;; Add the key binding
(global-set-key (kbd "C-c o") 'ollama-buddy-menu)
(global-set-key (kbd "C-c O") 'ollama-buddy-transient-menu)

;; Show a message to confirm we're in test mode
(message "Testing ollama-buddy in vanilla Emacs %s" emacs-version)
EOF

# Clean .elc files to avoid cross-version bytecode issues
echo "Cleaning .elc files..."
find "$PACKAGE_PATH" -maxdepth 1 -name "*.elc" -delete

# Run Emacs with the temporary init file
echo "Starting Emacs $VERSION with minimal configuration..."
echo "Testing ollama-buddy from: $PACKAGE_PATH"
echo "Temporary init file: $INIT_FILE"

# Run the appropriate Emacs version
"$HOME/bin/emacs-$VERSION" -Q -l "$INIT_FILE"

# Cleanup
echo "Cleaning up temporary directory..."
rm -rf "$TEMP_DIR"
#+end_src

#+RESULTS:
| Cleaning  | .elc         | files...  |                                       |         |                  |
| Starting  | Emacs        | 28.2      | with                                  | minimal | configuration... |
| Testing   | ollama-buddy | from:     | /home/jdyer/source/repos/ollama-buddy |         |                  |
| Temporary | init         | file:     | /tmp/ollama-buddy-test-OsOd6E/init.el |         |                  |
| Cleaning  | up           | temporary | directory...                          |         |                  |

** Prompt Text Edge Cases

Sending weird characters in the file =prompt-edge-text-cases.txt= with various edge cases and challenging content to test =ollama-buddy= text handling capabilities.

This test text src includes:

- Various Unicode and special characters
- Different types of quotation marks
- Mixed programming syntax
- Emojis and complex Unicode symbols
- Different line endings
- Shell commands with special characters
- SQL queries with mixed quotes
- URLs and file paths
- Mixed language content
- JSON-like structures

** Prompting

*** org-table weight calculations

#+PLOT: title:"Kate-a" ind:1 deps:(4) type:2d with:lines set:"yrange [220:290]"
|    | date             | st:pd | pds | lss | tot | bar                 |   av | %b/w |
|----+------------------+-------+-----+-----+-----+---------------------+------+------|
|  0 | <2023-08-18 Fri> |  20:6 | 286 |     |     | ██████████████████▉ |      |      |
|  1 | <2023-08-25 Fri> |  19:9 | 275 | -11 | -11 | ███████████████▊    | 11.0 |  4.0 |
|  2 | <2023-09-01 Fri> |  19:2 | 268 |  -7 | -18 | █████████████▊      |  9.0 |  6.7 |
|  3 | <2023-09-08 Fri> | 18:11 | 263 |  -5 | -23 | ████████████▎       |  7.7 |  8.7 |
|  4 | <2023-09-15 Fri> | 18:11 | 263 |   0 | -23 | ████████████▎       |  5.8 |  8.7 |
|  5 | <2023-09-22 Fri> | 18:13 | 265 |   2 | -21 | ████████████▉       |  4.2 |  7.9 |
|  6 | <2023-09-29 Fri> | 19:00 | 266 |   1 | -20 | █████████████▏      |  3.3 |  7.5 |
|  7 | <2023-10-06 Fri> |  18:6 | 258 |  -8 | -28 | ██████████▉         |  4.0 | 10.9 |
|  8 | <2023-10-13 Fri> |  18:6 | 258 |   0 | -28 | ██████████▉         |  3.5 | 10.9 |
|  9 | <2023-10-20 Fri> |  18:3 | 255 |  -3 | -31 | ██████████          |  3.4 | 12.2 |
| 10 | <2023-10-27 Fri> |  18:2 | 254 |  -1 | -32 | █████████▊          |  3.2 | 12.6 |
| 11 | <2023-11-03 Fri> | 17:13 | 251 |  -3 | -35 | ████████▉           |  3.2 | 13.9 |
| 12 | <2023-11-10 Fri> | 17:12 | 250 |  -1 | -36 | ████████▋           |  3.0 | 14.4 |
| 13 | <2023-11-17 Fri> |  17:8 | 246 |  -4 | -40 | ███████▍            |  3.1 | 16.3 |
| 14 | <2023-11-24 Fri> |  17:7 | 245 |  -1 | -41 | ███████▏            |  2.9 | 16.7 |
| 15 | <2023-12-01 Fri> |  17:3 | 241 |  -4 | -45 | ██████              |  3.0 | 18.7 |
| 16 | <2023-12-08 Fri> |  17:2 | 240 |  -1 | -46 | █████▊              |  2.9 | 19.2 |
| 17 | <2023-12-15 Fri> | 16:13 | 237 |  -3 | -49 | ████▉               |  2.9 | 20.7 |
| 18 | <2023-12-22 Fri> | 16:10 | 234 |  -3 | -52 | ████                |  2.9 | 22.2 |
| 19 | <2023-12-29 Fri> | 16:11 | 235 |   1 | -51 | ████▎               |  2.7 | 21.7 |
| 20 | <2024-01-05 Fri> | 16:12 | 236 |   1 | -50 | ████▋               |  2.5 | 21.2 |
| 21 | <2024-01-12 Fri> | 16:11 | 235 |  -1 | -51 | ████▎               |  2.4 | 21.7 |
| 22 | <2024-01-19 Fri> |  16:9 | 233 |  -2 | -53 | ███▊                |  2.4 | 22.7 |
| 23 | <2024-01-26 Fri> |  16:8 | 232 |  -1 | -54 | ███▍                |  2.3 | 23.3 |
| 24 | <2024-02-02 Fri> |  16:6 | 230 |  -2 | -56 | ██▉                 |  2.3 | 24.3 |
| 25 | <2024-02-09 Fri> |  16:5 | 229 |  -1 | -57 | ██▋                 |  2.3 | 24.9 |
| 26 | <2024-02-16 Fri> |  16:3 | 227 |  -2 | -59 | ██                  |  2.3 | 26.0 |
| 27 | <2024-02-23 Fri> |  16:3 | 227 |   0 | -59 | ██                  |  2.2 | 26.0 |
| 28 | <2024-03-01 Fri> |  16:3 | 227 |   0 | -59 | ██                  |  2.1 | 26.0 |
| 29 | <2024-03-08 Fri> |  16:3 | 227 |   0 | -59 | ██                  |  2.0 | 26.0 |
| 30 | <2024-03-15 Fri> |  16:2 | 226 |  -1 | -60 | █▊                  |  2.0 | 26.5 |
| 31 | <2024-03-22 Fri> |  16:2 | 226 |   0 | -60 | █▊                  |  1.9 | 26.5 |
#+TBLFM: $1=@#-2::$4='(convert-weight $3)::@3$5..@>$5=$4-@-1$4::@3$6..@>$6=vsum(@$5..@3$5)::$7='(orgtbl-uc-draw-cont $4 220 290 20)::@3$8..@>$8=abs(vmean(@3$5..@$5));%0.1f::@3$9..@>$9=(abs($6)/$4)*100;%0.1f

#+PLOT: title:"Kate-b" ind:1 deps:(4) type:2d with:lines set:"yrange [180:230]"
|   | date             | st:pd | pds | lss | tot | bar         |   av | %b/w |
|---+------------------+-------+-----+-----+-----+-------------+------+------|
| 0 | <2025-05-23 Fri> |  17:0 | 238 |     |     | ██████████▌ |      |      |
| 1 | <2025-05-30 Fri> |  16:2 | 226 | -12 | -12 | ████████▍   | 12.0 |  5.3 |
| 2 | <2025-06-06 Fri> | 15:11 | 221 |  -5 | -17 | ███████▌    |  8.5 |  7.7 |
| 3 | <2025-06-14 Sat> |  15:5 | 215 |  -6 | -23 | ██████▍     |  7.7 | 10.7 |
| 4 | <2025-06-20 Fri> |  15:6 | 216 |   1 | -22 | ██████▌     |  5.5 | 10.2 |
| 5 | <2025-06-29 Sun> |  15:9 | 219 |   3 | -19 | ███████▏    |  3.8 |  8.7 |
| 6 | <2025-07-04 Fri> |  15:6 | 216 |  -3 | -22 | ██████▌     |  3.7 | 10.2 |
| 7 | <2025-07-11 Fri> |  15:3 | 213 |  -3 | -25 | ██████      |  3.6 | 11.7 |
| 8 | <2025-08-08 Fri> |  15:2 | 212 |  -1 | -26 | █████▉      |  3.2 | 12.3 |
| 9 | <2026-02-04 Wed> |  14:5 | 201 | -11 | -37 | ███▉        |  4.1 | 18.4 |
#+TBLFM: $1=@#-2::$4='(convert-weight $3)::@3$5..@>$5=$4-@-1$4::@3$6..@>$6=vsum(@$5..@3$5)::$7='(orgtbl-uc-draw-cont $4 180 290 20)::@3$8..@>$8=abs(vmean(@3$5..@$5));%0.1f::@3$9..@>$9=(abs($6)/$4)*100;%0.1f

given the following org-mode tables regarding weight loss, can you tell me how much average weight has been lost for each period

**** common reponse

is to assume each row is per week and therefore incorrectly calculate, so to adjust pass in "you are counting the number of weeks as the number of rows, but each row is not necessarily a week, can you take the duration into account when calculating the averages"

*** Logic & Reasoning

If all bloops are razzles, and all razzles are lazzles, are all bloops lazzles?

Which is heavier: a ton of feathers or a ton of bricks?

A bat and ball cost $1.10. The bat costs $1 more than the ball. How much does the ball cost?

*** Common Sense

What happens when you put ice cubes in warm water?

Can you fold a piece of paper in half more than 7 times?

Why do we use umbrellas?

*** Pattern Recognition

What comes next: 2, 4, 8, 16, ?

Complete the pattern: circle, triangle, circle, square, circle, ?

If APPLE = 65, what does DOG equal?

*** Language Understanding

"The quick brown fox jumps over the lazy dog" - what's special about this sentence?

Explain the joke: "Why don't scientists trust atoms? Because they make up everything!"

What's the difference between "their," "there," and "they're"?

*** Simple Mathematics

What's 17% of 200?

If a pizza has 8 slices and 3 people share it equally, how many slices does each person get?

Simplify: (3 + 5) × 2 - 4

*** Creative Thinking

Write a 2-sentence horror story

Give me 3 unusual uses for a paperclip

If you were a color, what color would you be and why?

*** Bad Sentence

This aint a good sentence, pleez rewrite!

*** Temperature

This aint a good sentence, pleez rewrite!

Temperature 0.0:

Very pricise proofreading, typically only a single concise sentence.

Temperature to 2.0:

More casual, with a slangish alternative given.

*** History/context

History turned on:

What is the capital of the UK?

and of France

Now turn off History:

and of Germany

*** elisp structure to org-table

Given the following elisp data structure can you extract out an org table that contains the following columns : key : description : model

#+begin_src elisp
(setq ollama-buddy-command-definitions
      '(
        ;; General Commands
        (open-chat
         :key ?o
         :description "Open chat buffer"
         :action ollama-buddy--open-chat)
        
        (swap-model
         :key ?m
         :description "Swap model"
         :action ollama-buddy--swap-model)
        
        (send-region
         :key ?l
         :description "Send region"
         :action (lambda () (ollama-buddy--send-with-command 'send-region)))
        
        (describe-code
         :key ?c
         :description "Describe code"
         :model "qwen2.5-coder:3b"
         :prompt "describe the following code:"
         :action (lambda () (ollama-buddy--send-with-command 'describe-code)))
        
        (dictionary-lookup
         :key ?d
         :description "Dictionary Lookup"
         :model "llama3.2:1b"
         :prompt "For the following word provide a typical dictionary definition:"
         :action (lambda () (ollama-buddy--send-with-command 'dictionary-lookup)))
        
        (quit
         :key ?q
         :description "Quit"
         :action (lambda () (message "Quit Ollama Shell menu.")))
        )
      )
#+end_src

**** expected output

| Key | Description        | Model            |
|-----+--------------------+------------------|
| o   | Open chat buffer   |                  |
| m   | Swap model         |                  |
| l   | Send region        |                  |
| c   | Describe code      | qwen2.5-coder:3b |
| d   | Dictionary Lookup  | llama3.2:1b      |
| q   | Quit               |                  |
      
** Menu testing

Open up =leagues.txt=, select/mark any text, open up =ollama-buddy-menu= and test pushing given different prompting to the chat buffer.

** Run with test server (without ollama)

There is a test server written in python that can simulate many =ollama= responses so =ollama-buddy= can now be tested completely offline and of course the JSON explicitly inspected.

See =server.py= and run with:

~python3 ./server.py~
